In [1]:
import numpy as np
import pandas as pd
labels = ['a','b','c']
data = [10,203,50]

In [2]:
d={'a':10, 'b':20, 'c':30}
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [4]:
pd.Series(data=data)

0     10
1    203
2     50
dtype: int64

In [5]:
pd.Series(data=data,index=labels)

a     10
b    203
c     50
dtype: int64

In [6]:
pd.Series(data, labels)

a     10
b    203
c     50
dtype: int64

In [8]:
pd.Series(data, labels)

a     10
b    203
c     50
dtype: int64

In [9]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [10]:
pd.Series(data=[sum, print, len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [12]:
series1 = pd.Series([1,2,3,4], ['USA', 'GERMANY', 'USSR', 'BUTTOSKI'])

In [14]:
series1

USA         1
GERMANY     2
USSR        3
BUTTOSKI    4
dtype: int64

In [15]:
ser2 = pd.Series([1,2,3,4], ['USA', 'GERMANY', 'ALASKA', 'MONARE'])

In [16]:
ser2

USA        1
GERMANY    2
ALASKA     3
MONARE     4
dtype: int64

In [17]:
ser3 = pd.Series(data=labels)

In [18]:
ser3

0    a
1    b
2    c
dtype: object

In [20]:
ser3[0]

'a'

In [25]:
series1 + ser2

ALASKA      NaN
BUTTOSKI    NaN
GERMANY     4.0
MONARE      NaN
USA         2.0
USSR        NaN
dtype: float64

In [26]:
from numpy.random import randn
np.random.seed(101)

In [27]:
df = pd.DataFrame(randn(5,4), ['A','B','C', 'D','E'],['W', 'X', 'Y', 'Z'])

In [28]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [29]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [30]:
a = df['W']>0

In [31]:
a[df['W']]

W
 2.706850    NaN
 0.651118    NaN
-2.018168    NaN
 0.188695    NaN
 0.190794    NaN
Name: W, dtype: object

In [33]:
type(df['W'])

pandas.core.series.Series

In [34]:
type(df)

pandas.core.frame.DataFrame

In [35]:
df[['W', 'Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [38]:
df['new'] = df['W'] + df['Y']

In [39]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [40]:
df.drop('new', axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [44]:
df.drop('new', axis=1, inplace=True)

In [46]:
df['wxadd'] = df['X'] + df['Y']

In [47]:
df

          W         X         Y         Z     wxadd
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [50]:
df.drop(['A','B'], axis=0)

          W         X         Y         Z     wxadd
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [51]:
df.shape

(5, 5)

In [52]:
#rows

In [53]:
df

          W         X         Y         Z     wxadd
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [56]:
df.loc['A']

W        2.706850
X        0.628133
Y        0.907969
Z        0.503826
wxadd    1.536102
Name: A, dtype: float64

In [63]:
df.iloc[2:, :3]

          W         X         Y
C -2.018168  0.740122  0.528813
D  0.188695 -0.758872 -0.933237
E  0.190794  1.978757  2.605967

In [65]:
df.loc['B', 'Y']

-0.8480769834036315

In [66]:
df.loc[['A', 'B'], ['W', 'Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

In [68]:
booldf = df>0

In [69]:
df[booldf]

          W         X         Y         Z     wxadd
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118       NaN       NaN  0.605965       NaN
C       NaN  0.740122  0.528813       NaN  1.268936
D  0.188695       NaN       NaN  0.955057       NaN
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [70]:
df[df>0]

          W         X         Y         Z     wxadd
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118       NaN       NaN  0.605965       NaN
C       NaN  0.740122  0.528813       NaN  1.268936
D  0.188695       NaN       NaN  0.955057       NaN
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [71]:
df

          W         X         Y         Z     wxadd
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [72]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [77]:
resultdf = df[df['Z'] < 0]

In [82]:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [84]:
df[df['W']>0][['X', 'Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [86]:
boolser = df['W']>0
result = df[boolser]
mycols = ['Y', 'X']
result[mycols]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [90]:
[df[(df['W']>0) & (df['Y']>1)]]

[          W         X         Y         Z     wxadd
 E  0.190794  1.978757  2.605967  0.683509  4.584725]

In [91]:
[df[(df['W']>0) | (df['Y']>1)]]

[          W         X         Y         Z     wxadd
 A  2.706850  0.628133  0.907969  0.503826  1.536102
 B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
 D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
 E  0.190794  1.978757  2.605967  0.683509  4.584725]

In [92]:
[df[(df['W']>0)  (df['Y']>1)]]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [88]:
True and True

True

In [89]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [93]:
df.reset_index()

  index         W         X         Y         Z     wxadd
0     A  2.706850  0.628133  0.907969  0.503826  1.536102
1     B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
2     C -2.018168  0.740122  0.528813 -0.589001  1.268936
3     D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
4     E  0.190794  1.978757  2.605967  0.683509  4.584725

In [94]:
df

          W         X         Y         Z     wxadd
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In [95]:
new_ind = 'CA NY WY OR CO'.split()
new_ind

['CA', 'NY', 'WY', 'OR', 'CO']

In [96]:
df['states'] = new_ind

In [97]:
df

          W         X         Y         Z     wxadd states
A  2.706850  0.628133  0.907969  0.503826  1.536102     CA
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395     NY
C -2.018168  0.740122  0.528813 -0.589001  1.268936     WY
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109     OR
E  0.190794  1.978757  2.605967  0.683509  4.584725     CO

In [98]:
df.reset_index()

  index         W         X         Y         Z     wxadd states
0     A  2.706850  0.628133  0.907969  0.503826  1.536102     CA
1     B  0.651118 -0.319318 -0.848077  0.605965 -1.167395     NY
2     C -2.018168  0.740122  0.528813 -0.589001  1.268936     WY
3     D  0.188695 -0.758872 -0.933237  0.955057 -1.692109     OR
4     E  0.190794  1.978757  2.605967  0.683509  4.584725     CO

In [99]:
df.set_index('states')

               W         X         Y         Z     wxadd
states
CA      2.706850  0.628133  0.907969  0.503826  1.536102
NY      0.651118 -0.319318 -0.848077  0.605965 -1.167395
WY     -2.018168  0.740122  0.528813 -0.589001  1.268936
OR      0.188695 -0.758872 -0.933237  0.955057 -1.692109
CO      0.190794  1.978757  2.605967  0.683509  4.584725

In [100]:
import pandas as pd
import numpy as np

In [101]:
outside =['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside, inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [104]:
df = pd.DataFrame(randn(6,2), hier_index, ['A', 'B'])

In [105]:
df

             A         B
G1 1 -0.497104 -0.754070
   2 -0.943406  0.484752
   3 -0.116773  1.901755
G2 1  0.238127  1.996652
   2 -0.993263  0.196800
   3 -1.136645  0.000366

In [106]:
df.loc['G1']

          A         B
1 -0.497104 -0.754070
2 -0.943406  0.484752
3 -0.116773  1.901755

In [107]:
df.loc['G1'].loc[1]

A   -0.497104
B   -0.754070
Name: 1, dtype: float64

In [108]:
df.loc['G1'].loc[2]

A   -0.943406
B    0.484752
Name: 2, dtype: float64

In [109]:
df.index.names

FrozenList([None, None])

In [110]:
df.index.names = ['Groups', 'Num']

In [111]:
df

                   A         B
Groups Num
G1     1   -0.497104 -0.754070
       2   -0.943406  0.484752
       3   -0.116773  1.901755
G2     1    0.238127  1.996652
       2   -0.993263  0.196800
       3   -1.136645  0.000366

In [115]:
df.loc['G2'].loc[2]['B']

0.19679950499134005

In [117]:
df.loc['G1'].loc[2]['A']

-0.9434064032519315

In [118]:
df

                   A         B
Groups Num
G1     1   -0.497104 -0.754070
       2   -0.943406  0.484752
       3   -0.116773  1.901755
G2     1    0.238127  1.996652
       2   -0.993263  0.196800
       3   -1.136645  0.000366

In [120]:
df.loc['G1']

            A         B
Num
1   -0.497104 -0.754070
2   -0.943406  0.484752
3   -0.116773  1.901755

In [123]:
df.xs('G1')
#cross section

            A         B
Num
1   -0.497104 -0.754070
2   -0.943406  0.484752
3   -0.116773  1.901755

In [124]:
df.xs(1,level='Num')

               A         B
Groups
G1     -0.497104 -0.754070
G2      0.238127  1.996652

In [125]:
#missing data

In [126]:
import pandas as pd
import numpy as np

In [127]:
d = {'A': [1,2,np.nan], 'B':[5,np.nan,np.nan] ,'C':[1,3,2]}

In [128]:
df = pd.DataFrame(d)

In [129]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  3
2  NaN  NaN  2

In [130]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [132]:
df.dropna(axis=1)

   C
0  1
1  3
2  2

In [136]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  3

In [140]:
df.dropna(thresh=3)

     A    B  C
0  1.0  5.0  1

In [141]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  3
2  FILL VALUE  FILL VALUE  2

In [142]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [143]:
df.fillna(value=df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  3
2  1.5  5.0  2

In [144]:
data = {'company':['goog', 'goog', 'msft', 'msft', 'fb', 'fb'],
       'person':['sam', 'charlie', 'amy', 'vanessa', 'carl', 'sarah'],
       'sales':[200, 120, 340, 124, 243, 350]}

In [146]:
df = pd.DataFrame(data)

In [147]:
df

  company   person  sales
0    goog      sam    200
1    goog  charlie    120
2    msft      amy    340
3    msft  vanessa    124
4      fb     carl    243
5      fb    sarah    350

In [149]:
bycomp = df.groupby('company')

In [150]:
bycomp.mean()

         sales
company
fb       296.5
goog     160.0
msft     232.0

In [151]:
bycomp.sum()

         sales
company
fb         593
goog       320
msft       464

In [152]:
bycomp.std()

              sales
company
fb        75.660426
goog      56.568542
msft     152.735065

In [155]:
bycomp.sum().loc['fb']

sales    593
Name: fb, dtype: int64

In [161]:
df.groupby('company').max()

          person  sales
company
fb         sarah    350
goog         sam    200
msft     vanessa    340

In [164]:
df.groupby('company').describe().transpose()['fb']

sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: fb, dtype: float64

In [168]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])


df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 





df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

NameError: name 'l' is not defined

In [166]:
pd.concat([df1, df2, df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [167]:
pd.concat([df1, df2, df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [169]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [170]:
pd.merge(left, right, how='inner', on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [172]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [173]:
pd.merge(left, right, on=['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [174]:
pd.merge(left, right, how='outer', on=['key1', 'key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [175]:
pd.merge(left, right, how='right', on=['key1', 'key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [176]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [177]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [178]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'col1':[1,2,3,4],
                  'col2':[444,555,666,444],
                  'col3':['abc', 'def', 'ghi', 'xyz']})

In [3]:
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [4]:
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [5]:
len(df['col2'].unique())

3

In [6]:
df['col2'].nunique()

3

In [7]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [12]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

In [9]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [13]:
def time(x):
    return x*2

df['col1'].sum()

10

In [15]:
df['col1'].apply(time)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [17]:
df['col2'].apply(lambda x:x*3)

0    1332
1    1665
2    1998
3    1332
Name: col2, dtype: int64

In [18]:
df.drop('col1', axis=1, inplace=True)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [19]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [20]:
df.shape

(4, 3)

In [21]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [22]:
df.sort_values('col2')

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [23]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [24]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

In [25]:
df = pd.DataFrame(data)

In [26]:
df.isnull()

       A      B      C      D
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False  False  False
5  False  False  False  False

In [27]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [29]:
df['A'].unique()

array(['foo', 'bar'], dtype=object)

In [30]:
df['B'].nunique()

2

In [31]:
df.pivot_table(values='D', index=['A', 'B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [32]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [33]:
df.pivot_table(values='C', index=['A', 'D'], columns=['B'])

DataError: No numeric types to aggregate

In [34]:
pwd

'C:\\Users\\sid\\all notebooks'

In [41]:
import os

In [36]:
pd.read_csv('Example_csv')

FileNotFoundError: [Errno 2] File b'Example_csv' does not exist: b'Example_csv'

In [47]:
os.chdir('D:/tutorials/getfreetutorials/Python data science/Data/Python-for-Data-Analysis/Pandas')

In [48]:
df = pd.read_csv('example')

In [49]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [52]:
df.to_csv('myoutput', index=False)

In [53]:
pd.read_csv('myoutput')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [63]:
df.to_excel('Excel_Sample2.xlsx', sheet_name='newsheet')
#to save

In [67]:
data = pd.read_html('https://en.wikipedia.org/wiki/Number_of_terrorist_incidents_by_country')

In [70]:
df1 = data[0]

In [71]:
df1.max()

Year                   Total
Number ofincidents    182437
Deaths                414533
Injuries                   ?
Remarks                 None
dtype: object

In [76]:
from sqlalchemy import create_engine
engine = create_engine('sqlite:///:memory:')

In [77]:
df.to_sql('my_table', engine)

In [78]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [80]:
sqldf = pd.read_sql('my_table', con=engine)